app/controllers/steps_controller.rb

SELECT * FROM `steps` WHERE (`steps`.parent_id = 1)
---
  def show
    begin
      @step = Step.find(params[:id])

INSERT INTO `steps` (`status`, `updated_at`, `title`, `description`, `important`, `user_id`, `access`, `parent_id`, `created_at`) VALUES('new', '2011-12-31 09:19:00', 'klkl', 'klklk', 0, 1, 'inherit', NULL, '2011-12-31 09:19:00')
---
  def create
    @step = Step.new(params[:step])

    respond_to do |format|
      if @step.save

SELECT * FROM `steps` WHERE (`steps`.`id` = 1)
---
  def update
    @step = Step.find(params[:id])

SELECT * FROM `steps` WHERE (`steps`.`id` = 5)
DELETE FROM `steps` WHERE ((parent_id = 5))
---
  def destroy
    @step = Step.find(params[:id])
    parent = @step.parent
    @step.destroy